# Chapter 6 練習と総合問題解答

## 6.2 高度なSQL処理

### 6.2.2 exist文、case文、自己結合の応用

#### <練習問題 1>

case文を使って部署毎にgender別の人数を集計してみましょう。(特に部署移動等は考慮しなくて良いです。)

ヒント：case文をsum関数の中に記述できます。

In [3]:
use employees;
show tables;

use employees; show tables;
+---------------------+
| Tables_in_employees |
+---------------------+
| departments         |
| dept_emp            |
| dept_manager        |
| employees           |
| salaries            |
| titles              |
+---------------------+
6 rows in set (0.00 sec)

In [16]:
/*解答*/
select 
	t2.dept_no
	,sum(case when t.gender = 'M' then 1 else 0 end) MaleCount
	,sum(case when t.gender = 'F' then 1 else 0 end) FemaleCount
from employees.employees t
left outer join employees.dept_emp t2
on t2.emp_no = t.emp_no
group by t2.dept_no

/*解答*/ select t2.dept_no ,sum(case when t.gender = 'M' then 1 else 0 end) MaleCount ,sum(case when t.gender = 'F' then 1 else 0 end) FemaleCount from employees.employees t left outer join employees.dept_emp t2 on t2.emp_no = t.emp_no group by t2.dept_no;
+---------+-----------+-------------+
| dept_no | MaleCount | FemaleCount |
+---------+-----------+-------------+
| d001    |     12174 |        8037 |
| d002    |     10331 |        7015 |
| d003    |     10711 |        7075 |
| d004    |     43936 |       29549 |
| d005    |     51449 |       34258 |
| d006    |     12039 |        8078 |
| d007    |     31391 |       20854 |
| d008    |     12687 |        8439 |
| d009    |     14132 |        9448 |
+---------+-----------+-------------+
9 rows in set (1.01 sec)

#### <練習問題 2>

job titleの全ての組み合わせ（重複なし）を表示してみましょう。

In [28]:
/*解答*/
select a.title,b.title 
from 
(select title from titles group by title) a,
(select title from titles group by title) b
where a.title > b.title

/*解答*/ select a.title,b.title from (select title from titles group by title) a, (select title from titles group by title) b where a.title > b.title;
+------------------+--------------------+
| title            | title              |
+------------------+--------------------+
| Engineer         | Assistant Engineer |
| Manager          | Assistant Engineer |
| Senior Engineer  | Assistant Engineer |
| Senior Staff     | Assistant Engineer |
| Staff            | Assistant Engineer |
| Technique Leader | Assistant Engineer |
| Manager          | Engineer           |
| Senior Engineer  | Engineer           |
| Senior Staff     | Engineer           |
| Staff            | Engineer           |
| Technique Leader | Engineer           |
| Senior Engineer  | Manager            |
| Senior Staff     | Manager            |
| Staff            | Manager            |
| Technique Leader | Manager            |
| Senior Staff     | Senior Engineer    |
| Staff            | Senior Engineer    |
| Technique Leader | Senior Engineer    |
| Staff            | Senior Staff       |
| Technique Leader | Senior Staff       |
| Technique Leader | Staff              |
+------------------+--------------------+
21 rows in set (0.87 sec)

21通りになっているのがわかります。

#### <練習問題 3>

exists文を使って部署毎に現在job titleがStaffである人数を集計してみましょう。なお、現在とは、to_dateが9999-01-01のことを指すとします。

In [14]:
/*解答1*/
select dept_no,count(*) as staff_num from
(
select * from (select * from dept_emp where to_date = '9999-01-01') c
where exists ( select * from 
(select a.emp_no from titles a where title = 'staff' and a.to_date = '9999-01-01') b
where c.emp_no = b.emp_no )
) as staff_dept
group by dept_no;

/*解答1*/ select dept_no,count(*) as staff_num from ( select * from (select * from dept_emp where to_date = '9999-01-01') c where exists ( select * from (select a.emp_no from titles a where title = 'staff' and a.to_date = '9999-01-01') b where c.emp_no = b.emp_no ) ) as staff_dept group by dept_no;
+---------+-----------+
| dept_no | staff_num |
+---------+-----------+
| d001    |      3551 |
| d002    |      2891 |
| d003    |      3073 |
| d004    |       349 |
| d005    |       315 |
| d007    |      8903 |
| d008    |      2870 |
| d009    |      3574 |
+---------+-----------+
8 rows in set (2.36 sec)

In [29]:
/*別解*/
select t2.dept_no,count(t.emp_no)
from (select * from employees.titles 
where to_date = '9999-01-01' and title ='Staff'
) t
left outer join 
(select * from employees.dept_emp 
where to_date = '9999-01-01') t2
on t.emp_no = t2.emp_no
group by t2.dept_no;

/*別解*/ select t2.dept_no,count(t.emp_no) from (select * from employees.titles where to_date = '9999-01-01' and title ='Staff' ) t left outer join (select * from employees.dept_emp where to_date = '9999-01-01') t2 on t.emp_no = t2.emp_no group by t2.dept_no;
+---------+-----------------+
| dept_no | count(t.emp_no) |
+---------+-----------------+
| d001    |            3551 |
| d002    |            2891 |
| d003    |            3073 |
| d004    |             349 |
| d005    |             315 |
| d007    |            8903 |
| d008    |            2870 |
| d009    |            3574 |
+---------+-----------------+
8 rows in set (0.24 sec)

### 6.2.3 外部結合の応用

#### <練習問題 1>

各従業員について、最大給料が70,000以下の人、70,000～80,000の人、80,000～90,000の人、90,000より多い人でクロス表を作成してみましょう。

In [30]:
/*解答*/
select t.emp_no,max(t.salary),
case when max(t.salary) <= 70000 then 'Yes' else '' end as `under70,000`,
case when max(t.salary) >  70000 and max(t.salary) <= 80000 then 'Yes' else '' end as `from_70,000_to_80,000`,
case when max(t.salary) >  80000 and max(t.salary) <= 90000 then 'Yes' else '' end as `from_80,000_to_90,000`,
case when max(t.salary) >  90000 then 'Yes' else '' end as `over90,000`
from employees.salaries t
where t.salary 
group by t.emp_no
limit 10;

/*解答*/ select t.emp_no,max(t.salary), case when max(t.salary) <= 70000 then 'Yes' else '' end as `under70,000`, case when max(t.salary) >  70000 and max(t.salary) <= 80000 then 'Yes' else '' end as `from_70,000_to_80,000`, case when max(t.salary) >  80000 and max(t.salary) <= 90000 then 'Yes' else '' end as `from_80,000_to_90,000`, case when max(t.salary) >  90000 then 'Yes' else '' end as `over90,000` from employees.salaries t where t.salary group by t.emp_no limit 10;
+--------+---------------+-------------+-----------------------+-----------------------+------------+
| emp_no | max(t.salary) | under70,000 | from_70,000_to_80,000 | from_80,000_to_90,000 | over90,000 |
+--------+---------------+-------------+-----------------------+-----------------------+------------+
|  10001 |         88958 |             |                       | Yes                   |            |
|  10002 |         72527 |             | Yes                   |                       |            |
|  10003 |         43699 | Yes         |                       |                       |            |
|  10004 |         74057 |             | Yes                   |                       |            |
|  10005 |         94692 |             |                       |                       | Yes        |
|  10006 |         60098 | Yes         |                       |                       |            |
|  10007 |         88070 |             |                       | Yes                   |            |
|  10008 |         52668 | Yes         |                       |                       |            |
|  10009 |         94443 |             |                       |                       | Yes        |
|  10010 |         80324 |             |                       | Yes                   |            |
+--------+---------------+-------------+-----------------------+-----------------------+------------+
10 rows in set (0.00 sec)

#### <練習問題 2>

最大の給料が100,000より多い人のうち、最小の給料が90,000以上の人の数を求めてみましょう。

In [17]:
/*解答*/
select count(a.emp_no)
from 
(select emp_no from employees.salaries t group by emp_no having max(salary) > 100000) a
left outer join 
(select emp_no from employees.salaries t group by emp_no having min(salary) >= 90000) b
on a.emp_no = b.emp_no
where b.emp_no is not null

/*解答*/ select count(a.emp_no) from (select emp_no from employees.salaries t group by emp_no having max(salary) > 100000) a left outer join (select emp_no from employees.salaries t group by emp_no having min(salary) >= 90000) b on a.emp_no = b.emp_no where b.emp_no is not null;
+-----------------+
| count(a.emp_no) |
+-----------------+
|            4835 |
+-----------------+
1 row in set (2.42 sec)

## 6.3 ストアドプロシージャとスドアドファンクション
ゴール：ストアドプロシージャについて操作できること

### 6.3.1 ストアドプロシージャ

#### <練習問題 1>

次の処理を実行するストアド・プロシージャを作成して実行してみましょう。

・meiboテーブルと同じ構造のテーブルmeibo3を作成

・meiboテーブルのデータをmeibo3テーブルに挿入

・meibo3テーブルにweightカラムを追加

・引数で与えられたBMIとhighカラムの身長から体重を逆算してweightカラムに設定する（※BMI=体重(kg)÷(身長(m)×身長(m))

・meibo3の内容を出力

In [1]:
/*解答*/
/*データベース選択*/
use TEST1;
/*これから作成するストアドプロシージャと同じ物があれば削除*/
drop procedure if exists practice1;

/*解答*/ /*データベース選択*/ use test1; /*これから作成するストアドプロシージャと同じ物があれば削除*/ drop procedure if exists practice1;

Database changed
Query OK, 0 rows affected, 1 warning (0.00 sec)

In [2]:
delimiter //

delimiter //;

In [3]:
create procedure TEST1.practice1(in bmi int)
begin
/*これから作成するmeibo3テーブルが既にアレば削除*/
drop table if exists meibo3; 
/* meiboテーブルからテーブル構造をコピー*/
create table TEST1.meibo3 like test1.meibo;
/* meiboテーブルからデータをコピー*/
insert into  meibo3 select * from meibo;
/* weightカラムを作成*/
alter table TEST1.meibo3 add weight int null; 
/*引数で与えたBMIから体重を逆算*/
update TEST1.meibo3 set weight = pow(high/100,2) * bmi;
/*meibo3の内容を出力*/
select * from meibo3;
end
//

create procedure test1.practice1(in bmi int) begin /*これから作成するmeibo3テーブルが既にアレば削除*/ drop table if exists meibo3; /* meiboテーブルからテーブル構造をコピー*/ create table test1.meibo3 like test1.meibo; /* meiboテーブルからデータをコピー*/ insert into  meibo3 select * from meibo; /* weightカラムを作成*/ alter table test1.meibo3 add weight int null; /*引数で与えたBMIから体重を逆算*/ update test1.meibo3 set weight = pow(high/100,2) * bmi; /*meibo3の内容を出力*/ select * from meibo3; end //;

Query OK, 0 rows affected (0.00 sec)

In [4]:
delimiter ;

delimiter ;

In [5]:
call practice1(22);

call practice1(22);
+-----+--------------+-------+------+------+--------+
| id  | name         | class | age  | high | weight |
+-----+--------------+-------+------+------+--------+
|   1 | Yamada       |     1 |   14 |  150 |     50 |
|   2 | Tanaka       |     2 |   13 |  150 |     50 |
|   3 | Suzuki       |     1 |   13 |  150 |     50 |
|   4 | Kato         |     2 |   15 |  150 |     50 |
|   5 | Ito          |     3 |   12 |  155 |     53 |
|   6 | Takeuchi     |     2 |   16 |  155 |     53 |
|   7 | Kimura       |     3 |   11 |  160 |     56 |
|   8 | Sato         |     7 |   14 |  160 |     56 |
| 100 | dummy_Yamada |  NULL | NULL |  160 |     56 |
| 200 | dummy_Tanaka |  NULL | NULL |  160 |     56 |
| 300 | dummy_Sato   |  NULL | NULL |  160 |     56 |
+-----+--------------+-------+------+------+--------+
11 rows in set (0.03 sec)

Query OK, 0 rows affected (0.03 sec)

### 6.3.2 ストアドファンクション

#### <練習問題 1>

上記の例を参考に、meiboテーブルから平均身長を返す関数を作成して呼んでください。

In [1]:
use TEST1;
drop function if exists fc2;

use test1; drop function if exists fc2;

Database changed
Query OK, 0 rows affected (0.00 sec)

In [2]:
delimiter //

delimiter //;

In [3]:
create function fc2() returns double
begin
declare avgHigh double;
select avg(high) into avgHigh from meibo;
return avgHigh;
end
//

create function fc2() returns double begin declare avgHigh double; select avg(high) into avgHigh from meibo; return avgHigh; end //;

Query OK, 0 rows affected (0.00 sec)

In [4]:
delimiter ;

delimiter ;

In [5]:
select fc2();

select fc2();
+---------------+
| fc2()         |
+---------------+
| 155.454545454 |
+---------------+
1 row in set (0.00 sec)

#### <練習問題 2>

MySQLはナノ秒の取扱ができません。時、分、秒、ナノ秒（小数点以下の秒）の4つの引数を与えると "HH:MM:SS.sssssssss"形式の文字列(varchar(18))を返す関数を作って実行してみましょう。

ヒント：文字列の結合にはconcat関数が利用できます。

In [2]:
use TEST1;
drop function if exists getTime;

use test1; drop function if exists getTime;

Database changed
Query OK, 0 rows affected (0.00 sec)

In [3]:
delimiter //

delimiter //;

In [4]:
create function getTime(hour int,min int,sec int,nano_sec  varchar(9)) returns varchar(18)
begin
    return concat(hour,":",min,":",sec,".",nano_sec);
end
//

create function getTime(hour int,min int,sec int,nano_sec  varchar(9)) returns varchar(18) begin return concat(hour,":",min,":",sec,".",nano_sec); end //;

Query OK, 0 rows affected (0.00 sec)

In [5]:
delimiter ;

delimiter ;

In [6]:
select getTime(10,35,25,123);

select getTime(10,35,25,123);
+-----------------------+
| getTime(10,35,25,123) |
+-----------------------+
| 10:35:25.123          |
+-----------------------+
1 row in set (0.00 sec)

In [7]:
select getTime(10,35,25,'012345678');

select getTime(10,35,25,'012345678');
+-------------------------------+
| getTime(10,35,25,'012345678') |
+-------------------------------+
| 10:35:25.012345678            |
+-------------------------------+
1 row in set (0.00 sec)

***

## 6.4 インデクシングとSQLの高速化

### 6.4.1 インデックスの設定
キーワード：インデックス

#### <練習問題 1>

dept_empテーブルのfrom_date、to_dateに複合インデックスを設定してみましょう。

In [9]:
/*データベースの選択とインデックスの確認をします*/
use employees;
show index from dept_emp;

/*データベースの選択とインデックスの確認をします*/ use employees; show index from dept_emp;
+----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+------+------------+---------+---------------+
| Table    | Non_unique | Key_name | Seq_in_index | Column_name | Collation | Cardinality | Sub_part | Packed | Null | Index_type | Comment | Index_comment |
+----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+------+------------+---------+---------------+
| dept_emp |          0 | PRIMARY  |            1 | emp_no      | A         |      299636 |     NULL | NULL   |      | BTREE      |         |               |
| dept_emp |          0 | PRIMARY  |            2 | dept_no     | A         |      331143 |     NULL | NULL   |      | BTREE      |         |               |
| dept_emp |          1 | emp_no   |            1 | emp_no      | A         |      300786 |     NULL | NULL   |      | BTREE      |         |               |
| dept_emp |          1 | dept_no  |            1 | dept_no     | A         |           8 |     NULL | NULL   |      | BTREE      |         |               |
+----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+------+------------+---------+---------------+
4 rows in set (0.00 sec)

In [ ]:
/*解答*/
create index from_to_date on dept_emp(from_date, to_date);

In [ ]:
/*確認*/
show index from dept_emp;

## 6.6 総合問題

### 6.6.1 総合問題1

以下のデータベースを使って、次の問題を考えて実行してみましょう。

https://dev.mysql.com/doc/sakila/en/

(1) 支払金額の総額が100ドル以上の顧客名と支払総額を表示してください。

(2) (1)の結果を新しいテーブルに格納するストアド・プロシージャを作成してください。ただし、支払総額の閾値は引数で指定できるようにしてください。

In [10]:
/*解答(1)*/
select 	concat(c.first_name," ",c.last_name)  customerName,
		sum(p.amount) sumAmount
from sakila.payment p
left outer join sakila.customer c
on p.customer_id = c.customer_id
group by p.customer_id
having sum(p.amount) > 100
order by sumAmount desc

/*解答(1)*/ select 	concat(c.first_name," ",c.last_name)  customerName, sum(p.amount) sumAmount from sakila.payment p left outer join sakila.customer c on p.customer_id = c.customer_id group by p.customer_id having sum(p.amount) > 100 order by sumAmount desc;
+-----------------------+-----------+
| customerName          | sumAmount |
+-----------------------+-----------+
| KARL SEAL             |    221.55 |
| ELEANOR HUNT          |    216.54 |
| CLARA SHAW            |    195.58 |
| MARION SNYDER         |    194.61 |
| RHONDA KENNEDY        |    194.61 |
| TOMMY COLLAZO         |    186.62 |
| WESLEY BULL           |    177.60 |
| TIM CARY              |    175.61 |
| MARCIA DEAN           |    175.58 |
| ANA BRADLEY           |    174.66 |
| JUNE CARROLL          |    173.63 |
| LENA JENSEN           |    170.67 |
| DIANE COLLINS         |    169.65 |
| ARNOLD HAVENS         |    167.67 |
| CURTIS IRBY           |    167.62 |
| MIKE WAY              |    166.65 |
| DAISY BATES           |    162.62 |
| TONYA CHAPMAN         |    161.68 |
| LOUIS LEONE           |    161.65 |
| GORDON ALLARD         |    160.68 |
| BRITTANY RILEY        |    159.72 |
| GUY BROWNLEE          |    159.68 |
| WARREN SHERROD        |    159.67 |
| MARGIE WADE           |    159.64 |
| MAE FLETCHER          |    158.69 |
| STEVE MACKENZIE       |    158.66 |
| HARRY ARCE            |    157.65 |
| PRISCILLA LOWE        |    157.65 |
| ARTHUR SIMPKINS       |    155.68 |
| MICHELLE CLARK        |    155.65 |
| TAMMY SANDERS         |    155.59 |
| SUE PETERS            |    154.60 |
| SHERRY MARSHALL       |    153.66 |
| NEIL RENNER           |    152.68 |
| SHAWN HEATON          |    152.67 |
| JESSICA HALL          |    152.66 |
| LESLIE SEWARD         |    152.65 |
| NAOMI JENNINGS        |    152.65 |
| BRANDON HUEY          |    152.63 |
| ALEX GRESHAM          |    151.67 |
| MARIA MILLER          |    151.67 |
| STACEY MONTGOMERY     |    151.66 |
| ALMA AUSTIN           |    151.65 |
| ALEXANDER FENNELL     |    151.64 |
| MARSHA DOUGLAS        |    151.63 |
| RALPH MADRIGAL        |    150.66 |
| BILLY POULIN          |    149.65 |
| DUANE TUBBS           |    148.69 |
| JACQUELINE LONG       |    148.67 |
| CHRISTOPHER GRECO     |    147.69 |
| ROSEMARY SCHMIDT      |    147.65 |
| GLADYS HAMILTON       |    146.69 |
| ZACHARY HITE          |    146.69 |
| ROGER QUINTANILLA     |    146.64 |
| WANDA PATTERSON       |    145.70 |
| NICHOLAS BARFIELD     |    145.68 |
| BERNICE WILLIS        |    145.67 |
| TROY QUIGLEY          |    144.70 |
| OLGA JIMENEZ          |    144.68 |
| TANYA GILBERT         |    144.67 |
| JANICE WARD           |    144.66 |
| ELIZABETH BROWN       |    144.62 |
| ROY WHITING           |    143.71 |
| JERRY JORDON          |    143.71 |
| SYLVIA ORTIZ          |    143.68 |
| VIOLET RODRIQUEZ      |    142.70 |
| RYAN SALISBURY        |    142.70 |
| MINNIE ROMERO         |    142.66 |
| CATHERINE CAMPBELL    |    142.66 |
| DEBRA NELSON          |    141.71 |
| GREG ROBINS           |    141.70 |
| LORI WOOD             |    141.69 |
| SARA PERRY            |    141.67 |
| JESSIE MILAM          |    141.67 |
| CASEY MENA            |    141.66 |
| ELSIE KELLEY          |    141.63 |
| RAMON CHOATE          |    140.69 |
| GLENDA FRAZIER        |    140.68 |
| ANGELA HERNANDEZ      |    140.64 |
| ALVIN DELOACH         |    139.71 |
| JAMIE RICE            |    139.71 |
| STANLEY SCROGGINS     |    139.70 |
| ROBERTO VU            |    139.70 |
| GRACE ELLIS           |    139.67 |
| MORRIS MCCARTER       |    139.66 |
| JOE GILLILAND         |    138.71 |
| MAURICE CRAWLEY       |    138.71 |
| CHARLES KOWALSKI      |    138.68 |
| ALICE STEWART         |    138.67 |
| BRETT CORNWELL        |    138.66 |
| MARILYN ROSS          |    137.70 |
| JOHN FARNSWORTH       |    137.69 |
| ELLA OLIVER           |    137.69 |
| CRYSTAL FORD          |    137.67 |
| GERTRUDE CASTILLO     |    137.66 |
| JEANNE LAWSON         |    136.73 |
| RUSSELL BRINSON       |    136.64 |
| MIRIAM MCKINNEY       |    135.74 |
| LINDA WILLIAMS        |    135.74 |
| JIMMIE EGGLESTON      |    135.72 |
| MIGUEL BETANCOURT     |    135.71 |
| GLORIA COOK           |    135.70 |
| RAYMOND MCWHORTER     |    135.70 |
| DIANNE SHELTON        |    135.69 |
| ETHEL WEBB            |    135.68 |
| JAVIER ELROD          |    135.68 |
| REGINA BERRY          |    135.66 |
| KENT ARSENAULT        |    134.73 |
| JOSEPH JOY            |    134.70 |
| HELEN HARRIS          |    134.68 |
| DAVE GARDINER         |    134.68 |
| JULIA FLORES          |    134.68 |
| MITCHELL WESTMORELAND |    134.68 |
| BARRY LOVELACE        |    134.67 |
| JORGE OLIVARES        |    134.66 |
| DON BONE              |    133.75 |
| CHERYL MURPHY         |    133.73 |
| TINA SIMMONS          |    133.72 |
| NATHANIEL ADAM        |    133.72 |
| DANA HART             |    133.71 |
| JENNIE TERRY          |    133.71 |
| ROSA REYNOLDS         |    133.70 |
| BESSIE MORRISON       |    132.72 |
| STEVEN CURLEY         |    132.71 |
| JORDAN ARCHULETA      |    132.70 |
| TRACY COLE            |    132.70 |
| RONALD WEINER         |    132.70 |
| COURTNEY DAY          |    132.68 |
| KAREN JACKSON         |    131.73 |
| JAMES GANNON          |    131.70 |
| GEORGE LINTON         |    131.67 |
| KATHRYN COLEMAN       |    130.74 |
| EDUARDO HIATT         |    130.73 |
| JOYCE EDWARDS         |    130.72 |
| MICHELE GRANT         |    130.70 |
| HAROLD MARTINO        |    130.68 |
| DEBBIE REYES          |    130.68 |
| GILBERT SLEDGE        |    129.72 |
| TRACY HERRMANN        |    129.72 |
| KATHY JAMES           |    129.70 |
| SALVADOR TEEL         |    129.70 |
| RAMONA HALE           |    129.70 |
| CASSANDRA WALTERS     |    129.70 |
| VIOLA HANSON          |    129.68 |
| VIRGINIA GREEN        |    129.68 |
| JUSTIN NGO            |    129.64 |
| PATRICIA JOHNSON      |    128.73 |
| EDDIE TOMLIN          |    128.73 |
| JASON MORRISSEY       |    128.72 |
| TERESA ROGERS         |    128.71 |
| MONICA HICKS          |    128.70 |
| JIM REA               |    128.67 |
| SHERRI RHODES         |    128.67 |
| MILTON HOWLAND        |    127.75 |
| JANET PHILLIPS        |    127.73 |
| TERRY CARLSON         |    127.71 |
| AMY LOPEZ             |    127.71 |
| MICHAEL SILVERMAN     |    127.71 |
| WALTER PERRYMAN       |    127.70 |
| FRANK WAGGONER        |    127.68 |
| MARJORIE TUCKER       |    127.68 |
| JOANNE ROBERTSON      |    127.66 |
| MARTHA GONZALEZ       |    127.66 |
| BRADLEY MOTLEY        |    126.73 |
| TERRI VASQUEZ         |    126.73 |
| SONIA GREGORY         |    126.72 |
| ANDRE RAPP            |    126.72 |
| JAIME NETTLES         |    126.71 |
| ISAAC OGLESBY         |    126.71 |
| FLORENCE WOODS        |    126.70 |
| SHIRLEY ALLEN         |    126.69 |
| VERONICA STONE        |    126.68 |
| THELMA MURRAY         |    126.68 |
| RUTH MARTINEZ         |    125.76 |
| ALAN KAHN             |    124.74 |
| RICK MATTOX           |    124.73 |
| BRYAN HARDISON        |    124.72 |
| CRAIG MORRELL         |    124.70 |
| JOY GEORGE            |    124.67 |
| CARRIE PORTER         |    124.66 |
| LYNN PAYNE            |    123.72 |
| NINA SOTO             |    123.71 |
| MARC OUTLAW           |    123.70 |
| MELISSA KING          |    123.66 |
| BEN EASTER            |    122.74 |
| ERIC ROBERT           |    122.73 |
| BRANDY GRAVES         |    122.72 |
| HILDA HOPKINS         |    122.71 |
| CATHY SPENCER         |    122.71 |
| CHRISTY VARGAS        |    122.69 |
| NATHAN RUNYON         |    122.68 |
| HEIDI LARSON          |    122.66 |
| JOHNNIE CHISHOLM      |    121.76 |
| VALERIE BLACK         |    121.74 |
| GERALD FULTZ          |    121.70 |
| JEFFERY PINSON        |    121.69 |
| PHILIP CAUSEY         |    121.69 |
| PAUL TROUT            |    120.77 |
| ARLENE HARVEY         |    120.74 |
| CHARLIE BESS          |    120.74 |
| ALFRED CASILLAS       |    120.74 |
| DAWN SULLIVAN         |    120.74 |
| BYRON BOX             |    120.71 |
| SANDRA MARTIN         |    120.71 |
| VICKIE BREWER         |    120.69 |
| BEATRICE ARNOLD       |    119.74 |
| HECTOR POINDEXTER     |    119.74 |
| LEE HAWKS             |    119.73 |
| PATSY DAVIDSON        |    119.72 |
| AUDREY RAY            |    119.71 |
| JOSHUA MARK           |    119.70 |
| SARAH LEWIS           |    119.70 |
| PATRICK NEWSOM        |    119.69 |
| SALLY PIERCE          |    119.68 |
| JAMIE WAUGH           |    118.75 |
| STEPHANIE MITCHELL    |    118.75 |
| TRACEY BARRETT        |    118.73 |
| MISTY LAMBERT         |    118.73 |
| NORA HERRERA          |    118.72 |
| CLIFTON MALCOLM       |    118.72 |
| STEPHEN QUALLS        |    118.72 |
| ERIK GUILLEN          |    118.71 |
| MARY SMITH            |    118.68 |
| LEROY BUSTAMANTE      |    118.68 |
| MARSHALL THORN        |    117.77 |
| SAM MCDUFFIE          |    117.76 |
| PERRY SWAFFORD        |    117.76 |
| FERNANDO CHURCHILL    |    117.75 |
| MARLENE WELCH         |    117.74 |
| VELMA LUCAS           |    117.73 |
| ELLEN SIMPSON         |    117.72 |
| BETTY WHITE           |    117.72 |
| TODD TAN              |    117.71 |
| TED BREAUX            |    117.71 |
| TERRENCE GUNDERSON    |    117.70 |
| CAROLYN PEREZ         |    117.70 |
| KEVIN SCHULER         |    116.78 |
| EDWIN BURK            |    116.77 |
| MANUEL MURRELL        |    116.70 |
| THEODORE CULP         |    116.69 |
| KRISTIN JOHNSTON      |    116.69 |
| MAXINE SILVA          |    116.68 |
| DAVID ROYAL           |    115.74 |
| CECIL VINES           |    115.74 |
| JEAN BELL             |    115.73 |
| REGINALD KINDER       |    115.72 |
| HERMAN DEVORE         |    115.71 |
| DEBORAH WALKER        |    115.71 |
| MARION OCAMPO         |    115.71 |
| BECKY MILES           |    115.71 |
| CLYDE TOBIAS          |    115.71 |
| MARCUS HIDALGO        |    115.70 |
| SHARON ROBINSON       |    115.70 |
| HEATHER MORRIS        |    115.70 |
| ANGEL BARCLAY         |    115.68 |
| JESUS MCCARTNEY       |    114.76 |
| DOUGLAS GRAF          |    114.75 |
| DOLORES WAGNER        |    114.74 |
| MARIE TURNER          |    114.74 |
| CHARLENE ALVAREZ      |    114.73 |
| EDWARD BAUGH          |    114.72 |
| EVELYN MORGAN         |    114.72 |
| BILL GAVIN            |    114.72 |
| DENNIS GILMAN         |    114.72 |
| MATTHEW MAHAN         |    114.69 |
| HOLLY FOX             |    114.69 |
| LAURA RODRIGUEZ       |    113.78 |
| ANDY VANHORN          |    113.75 |
| GLEN TALBERT          |    113.74 |
| SHELLY WATTS          |    113.74 |
| RENE MCALISTER        |    113.74 |
| AMBER DIXON           |    113.73 |
| CINDY FISHER          |    113.71 |
| CLIFFORD BOWENS       |    113.71 |
| DARLENE ROSE          |    113.69 |
| LOIS BUTLER           |    113.65 |
| BRENT HARKINS         |    112.77 |
| TYRONE ASHER          |    112.76 |
| ASHLEY RICHARDSON     |    112.75 |
| SETH HANNON           |    112.75 |
| LARRY THRASHER        |    112.74 |
| DALE RATCLIFF         |    112.73 |
| MARIO CHEATHAM        |    112.72 |
| GERALDINE PERKINS     |    112.70 |
| MABEL HOLLAND         |    112.70 |
| CALVIN MARTEL         |    111.77 |
| CLAUDE HERZOG         |    111.75 |
| CLAUDIA FULLER        |    111.74 |
| GABRIEL HARDER        |    111.74 |
| VICTORIA GIBSON       |    111.73 |
| DARYL LARUE           |    111.73 |
| EARL SHANKS           |    111.73 |
| GINA WILLIAMSON       |    111.72 |
| TERRANCE ROUSH        |    111.71 |
| CYNTHIA YOUNG         |    111.68 |
| MYRTLE FLEMING        |    110.76 |
| AARON SELBY           |    110.76 |
| TRAVIS ESTEP          |    110.75 |
| GEORGIA JACOBS        |    110.74 |
| YOLANDA WEAVER        |    110.73 |
| AMANDA CARTER         |    110.73 |
| EVERETT BANDA         |    110.72 |
| RANDY GAITHER         |    110.72 |
| RUBY WASHINGTON       |    110.72 |
| KEN PREWITT           |    110.71 |
| JUANITA MASON         |    110.70 |
| KYLE SPURLOCK         |    110.70 |
| HAZEL WARREN          |    110.66 |
| DAN PAINE             |    109.78 |
| KATIE ELLIOTT         |    109.75 |
| LEON BOSTIC           |    109.75 |
| RICHARD MCCRARY       |    109.75 |
| WALLACE SLONE         |    109.75 |
| GAIL KNIGHT           |    109.75 |
| JOSEPHINE GOMEZ       |    109.74 |
| ANDREW PURDY          |    109.73 |
| DEAN SAUER            |    109.73 |
| KRISTINA CHAMBERS     |    109.72 |
| JULIAN VEST           |    109.72 |
| LEONARD SCHOFIELD     |    109.68 |
| FRANCES PARKER        |    108.78 |
| DARREN WINDHAM        |    108.76 |
| SIDNEY BURLESON       |    108.75 |
| VICKI FIELDS          |    108.75 |
| SERGIO STANFIELD      |    108.74 |
| LUCILLE HOLMES        |    108.72 |
| CAROLE BARNETT        |    108.70 |
| DORA MEDINA           |    107.77 |
| MARIAN MENDOZA        |    107.77 |
| ELAINE STEVENS        |    107.76 |
| MAX PITT              |    107.76 |
| DEANNA BYRD           |    107.74 |
| KELLY KNOTT           |    107.74 |
| EDNA WEST             |    107.74 |
| VIRGIL WOFFORD        |    107.73 |
| JULIE SANCHEZ         |    107.71 |
| JEFF EAST             |    107.70 |
| TOM MILNER            |    107.68 |
| CARL ARTIS            |    106.77 |
| PETER MENARD          |    106.77 |
| CARLOS COUGHLIN       |    106.77 |
| LISA ANDERSON         |    106.76 |
| LILLIAN GRIFFIN       |    106.75 |
| ERIN DUNN             |    106.73 |
| BOBBY BOUDREAU        |    106.65 |
| FREDERICK ISBELL      |    105.79 |
| THOMAS GRIGSBY        |    105.75 |
| VINCENT RALSTON       |    105.75 |
| DANIELLE DANIELS      |    105.75 |
| BRAD MCCURDY          |    105.75 |
| DIANA ALEXANDER       |    105.73 |
| JIMMY SCHRADER        |    105.71 |
| STELLA MORENO         |    104.78 |
| RODNEY MOELLER        |    104.77 |
| LEO EBERT             |    104.77 |
| LEAH CURTIS           |    104.75 |
| MARK RINEHART         |    104.74 |
| BRENDA WRIGHT         |    104.74 |
| FRANCIS SIKES         |    104.74 |
| CLARENCE GAMEZ        |    104.70 |
| ROSE HOWARD           |    103.78 |
| RON DELUCA            |    103.77 |
| BRUCE SCHWARZ         |    103.77 |
| PEDRO CHESTNUT        |    103.76 |
| CLINTON BUFORD        |    103.75 |
| BETH FRANKLIN         |    103.75 |
| GARY COY              |    103.75 |
| CARLA GUTIERREZ       |    103.74 |
| DENISE KELLY          |    103.73 |
| JENNY CASTRO          |    103.73 |
| MARTIN BALES          |    103.73 |
| NANCY THOMAS          |    103.72 |
| JEREMY HURTADO        |    103.72 |
| ROBIN HAYES           |    102.76 |
| MICHEAL FORMAN        |    102.74 |
| DWAYNE OLVERA         |    101.78 |
| ADAM GOOCH            |    101.78 |
| COREY HAUSER          |    101.78 |
| BERTHA FERGUSON       |    101.75 |
| LOUISE JENKINS        |    101.75 |
| WILLIE MARKHAM        |    101.75 |
| ERIKA PENA            |    101.74 |
| PHILLIP HOLM          |    101.74 |
| JESSE SCHILLING       |    101.74 |
| WILLIE HOWELL         |    101.74 |
| RAUL FORTIER          |    100.80 |
| DORIS REED            |    100.78 |
| CONNIE WALLACE        |    100.77 |
| SHANNON FREEMAN       |    100.76 |
| RONNIE RICKETTS       |    100.75 |
| WILLIAM SATTERFIELD   |    100.74 |
| DUSTIN GILLETTE       |    100.74 |
| JANE BENNETT          |    100.72 |
| LAWRENCE LAWTON       |    100.69 |
| JUDITH COX            |    100.67 |
+-----------------------+-----------+
395 rows in set (0.06 sec)

In [73]:
/*解答(2)*/
use sakila; 
drop procedure if exists practice;

/*解答(2)*/ use sakila; drop procedure if exists practice;

Database changed
Query OK, 0 rows affected, 1 warning (0.00 sec)

In [11]:
delimiter //

delimiter //;

In [12]:
create procedure sakila.practice(in threshold DECIMAL(20,2))
begin
drop table if exists newTable;
create table sakila.newTable (
	`customerName` varchar(91) NOT NULL,
	`sumPaymentAmount`  DECIMAL(20,2) NOT NULL,
	`last_update` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
	PRIMARY KEY (`customerName`)
);

insert into sakila.newTable 
select 	concat(c.first_name," ",c.last_name)  customerName,
			sum(p.amount) sumAmount,
			null
from sakila.payment p
left outer join sakila.customer c
on p.customer_id = c.customer_id
group by p.customer_id
having sum(p.amount) > threshold;

end
//

create procedure sakila.practice(in threshold DECIMAL(20,2)) begin drop table if exists newTable; create table sakila.newTable ( `customerName` varchar(91) NOT NULL, `sumPaymentAmount`  DECIMAL(20,2) NOT NULL, `last_update` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP, PRIMARY KEY (`customerName`) ); insert into sakila.newTable select 	concat(c.first_name," ",c.last_name)  customerName, sum(p.amount) sumAmount, null from sakila.payment p left outer join sakila.customer c on p.customer_id = c.customer_id group by p.customer_id having sum(p.amount) > threshold; end //;

Query OK, 0 rows affected (0.00 sec)

In [13]:
delimiter ;

delimiter ;

In [15]:
use sakila;

use sakila;

Database changed

In [16]:
call practice(120);
select * from sakila.newTable order by sumPaymentAmount desc;

call practice(120); select * from sakila.newTable order by sumPaymentAmount desc;
+-----------------------+------------------+---------------------+
| customerName          | sumPaymentAmount | last_update         |
+-----------------------+------------------+---------------------+
| KARL SEAL             |           221.55 | 2017-04-30 11:25:10 |
| ELEANOR HUNT          |           216.54 | 2017-04-30 11:25:10 |
| CLARA SHAW            |           195.58 | 2017-04-30 11:25:10 |
| MARION SNYDER         |           194.61 | 2017-04-30 11:25:10 |
| RHONDA KENNEDY        |           194.61 | 2017-04-30 11:25:10 |
| TOMMY COLLAZO         |           186.62 | 2017-04-30 11:25:10 |
| WESLEY BULL           |           177.60 | 2017-04-30 11:25:10 |
| TIM CARY              |           175.61 | 2017-04-30 11:25:10 |
| MARCIA DEAN           |           175.58 | 2017-04-30 11:25:10 |
| ANA BRADLEY           |           174.66 | 2017-04-30 11:25:10 |
| JUNE CARROLL          |           173.63 | 2017-04-30 11:25:10 |
| LENA JENSEN           |           170.67 | 2017-04-30 11:25:10 |
| DIANE COLLINS         |           169.65 | 2017-04-30 11:25:10 |
| ARNOLD HAVENS         |           167.67 | 2017-04-30 11:25:10 |
| CURTIS IRBY           |           167.62 | 2017-04-30 11:25:10 |
| MIKE WAY              |           166.65 | 2017-04-30 11:25:10 |
| DAISY BATES           |           162.62 | 2017-04-30 11:25:10 |
| TONYA CHAPMAN         |           161.68 | 2017-04-30 11:25:10 |
| LOUIS LEONE           |           161.65 | 2017-04-30 11:25:10 |
| GORDON ALLARD         |           160.68 | 2017-04-30 11:25:10 |
| BRITTANY RILEY        |           159.72 | 2017-04-30 11:25:10 |
| GUY BROWNLEE          |           159.68 | 2017-04-30 11:25:10 |
| WARREN SHERROD        |           159.67 | 2017-04-30 11:25:10 |
| MARGIE WADE           |           159.64 | 2017-04-30 11:25:10 |
| MAE FLETCHER          |           158.69 | 2017-04-30 11:25:10 |
| STEVE MACKENZIE       |           158.66 | 2017-04-30 11:25:10 |
| HARRY ARCE            |           157.65 | 2017-04-30 11:25:10 |
| PRISCILLA LOWE        |           157.65 | 2017-04-30 11:25:10 |
| ARTHUR SIMPKINS       |           155.68 | 2017-04-30 11:25:10 |
| MICHELLE CLARK        |           155.65 | 2017-04-30 11:25:10 |
| TAMMY SANDERS         |           155.59 | 2017-04-30 11:25:10 |
| SUE PETERS            |           154.60 | 2017-04-30 11:25:10 |
| SHERRY MARSHALL       |           153.66 | 2017-04-30 11:25:10 |
| NEIL RENNER           |           152.68 | 2017-04-30 11:25:10 |
| SHAWN HEATON          |           152.67 | 2017-04-30 11:25:10 |
| JESSICA HALL          |           152.66 | 2017-04-30 11:25:10 |
| LESLIE SEWARD         |           152.65 | 2017-04-30 11:25:10 |
| NAOMI JENNINGS        |           152.65 | 2017-04-30 11:25:10 |
| BRANDON HUEY          |           152.63 | 2017-04-30 11:25:10 |
| ALEX GRESHAM          |           151.67 | 2017-04-30 11:25:10 |
| MARIA MILLER          |           151.67 | 2017-04-30 11:25:10 |
| STACEY MONTGOMERY     |           151.66 | 2017-04-30 11:25:10 |
| ALMA AUSTIN           |           151.65 | 2017-04-30 11:25:10 |
| ALEXANDER FENNELL     |           151.64 | 2017-04-30 11:25:10 |
| MARSHA DOUGLAS        |           151.63 | 2017-04-30 11:25:10 |
| RALPH MADRIGAL        |           150.66 | 2017-04-30 11:25:10 |
| BILLY POULIN          |           149.65 | 2017-04-30 11:25:10 |
| DUANE TUBBS           |           148.69 | 2017-04-30 11:25:10 |
| JACQUELINE LONG       |           148.67 | 2017-04-30 11:25:10 |
| CHRISTOPHER GRECO     |           147.69 | 2017-04-30 11:25:10 |
| ROSEMARY SCHMIDT      |           147.65 | 2017-04-30 11:25:10 |
| GLADYS HAMILTON       |           146.69 | 2017-04-30 11:25:10 |
| ZACHARY HITE          |           146.69 | 2017-04-30 11:25:10 |
| ROGER QUINTANILLA     |           146.64 | 2017-04-30 11:25:10 |
| WANDA PATTERSON       |           145.70 | 2017-04-30 11:25:10 |
| NICHOLAS BARFIELD     |           145.68 | 2017-04-30 11:25:10 |
| BERNICE WILLIS        |           145.67 | 2017-04-30 11:25:10 |
| TROY QUIGLEY          |           144.70 | 2017-04-30 11:25:10 |
| OLGA JIMENEZ          |           144.68 | 2017-04-30 11:25:10 |
| TANYA GILBERT         |           144.67 | 2017-04-30 11:25:10 |
| JANICE WARD           |           144.66 | 2017-04-30 11:25:10 |
| ELIZABETH BROWN       |           144.62 | 2017-04-30 11:25:10 |
| JERRY JORDON          |           143.71 | 2017-04-30 11:25:10 |
| ROY WHITING           |           143.71 | 2017-04-30 11:25:10 |
| SYLVIA ORTIZ          |           143.68 | 2017-04-30 11:25:10 |
| RYAN SALISBURY        |           142.70 | 2017-04-30 11:25:10 |
| VIOLET RODRIQUEZ      |           142.70 | 2017-04-30 11:25:10 |
| CATHERINE CAMPBELL    |           142.66 | 2017-04-30 11:25:10 |
| MINNIE ROMERO         |           142.66 | 2017-04-30 11:25:10 |
| DEBRA NELSON          |           141.71 | 2017-04-30 11:25:10 |
| GREG ROBINS           |           141.70 | 2017-04-30 11:25:10 |
| LORI WOOD             |           141.69 | 2017-04-30 11:25:10 |
| JESSIE MILAM          |           141.67 | 2017-04-30 11:25:10 |
| SARA PERRY            |           141.67 | 2017-04-30 11:25:10 |
| CASEY MENA            |           141.66 | 2017-04-30 11:25:10 |
| ELSIE KELLEY          |           141.63 | 2017-04-30 11:25:10 |
| RAMON CHOATE          |           140.69 | 2017-04-30 11:25:10 |
| GLENDA FRAZIER        |           140.68 | 2017-04-30 11:25:10 |
| ANGELA HERNANDEZ      |           140.64 | 2017-04-30 11:25:10 |
| ALVIN DELOACH         |           139.71 | 2017-04-30 11:25:10 |
| JAMIE RICE            |           139.71 | 2017-04-30 11:25:10 |
| ROBERTO VU            |           139.70 | 2017-04-30 11:25:10 |
| STANLEY SCROGGINS     |           139.70 | 2017-04-30 11:25:10 |
| GRACE ELLIS           |           139.67 | 2017-04-30 11:25:10 |
| MORRIS MCCARTER       |           139.66 | 2017-04-30 11:25:10 |
| JOE GILLILAND         |           138.71 | 2017-04-30 11:25:10 |
| MAURICE CRAWLEY       |           138.71 | 2017-04-30 11:25:10 |
| CHARLES KOWALSKI      |           138.68 | 2017-04-30 11:25:10 |
| ALICE STEWART         |           138.67 | 2017-04-30 11:25:10 |
| BRETT CORNWELL        |           138.66 | 2017-04-30 11:25:10 |
| MARILYN ROSS          |           137.70 | 2017-04-30 11:25:10 |
| ELLA OLIVER           |           137.69 | 2017-04-30 11:25:10 |
| JOHN FARNSWORTH       |           137.69 | 2017-04-30 11:25:10 |
| CRYSTAL FORD          |           137.67 | 2017-04-30 11:25:10 |
| GERTRUDE CASTILLO     |           137.66 | 2017-04-30 11:25:10 |
| JEANNE LAWSON         |           136.73 | 2017-04-30 11:25:10 |
| RUSSELL BRINSON       |           136.64 | 2017-04-30 11:25:10 |
| LINDA WILLIAMS        |           135.74 | 2017-04-30 11:25:10 |
| MIRIAM MCKINNEY       |           135.74 | 2017-04-30 11:25:10 |
| JIMMIE EGGLESTON      |           135.72 | 2017-04-30 11:25:10 |
| MIGUEL BETANCOURT     |           135.71 | 2017-04-30 11:25:10 |
| GLORIA COOK           |           135.70 | 2017-04-30 11:25:10 |
| RAYMOND MCWHORTER     |           135.70 | 2017-04-30 11:25:10 |
| DIANNE SHELTON        |           135.69 | 2017-04-30 11:25:10 |
| ETHEL WEBB            |           135.68 | 2017-04-30 11:25:10 |
| JAVIER ELROD          |           135.68 | 2017-04-30 11:25:10 |
| REGINA BERRY          |           135.66 | 2017-04-30 11:25:10 |
| KENT ARSENAULT        |           134.73 | 2017-04-30 11:25:10 |
| JOSEPH JOY            |           134.70 | 2017-04-30 11:25:10 |
| DAVE GARDINER         |           134.68 | 2017-04-30 11:25:10 |
| HELEN HARRIS          |           134.68 | 2017-04-30 11:25:10 |
| JULIA FLORES          |           134.68 | 2017-04-30 11:25:10 |
| MITCHELL WESTMORELAND |           134.68 | 2017-04-30 11:25:10 |
| BARRY LOVELACE        |           134.67 | 2017-04-30 11:25:10 |
| JORGE OLIVARES        |           134.66 | 2017-04-30 11:25:10 |
| DON BONE              |           133.75 | 2017-04-30 11:25:10 |
| CHERYL MURPHY         |           133.73 | 2017-04-30 11:25:10 |
| NATHANIEL ADAM        |           133.72 | 2017-04-30 11:25:10 |
| TINA SIMMONS          |           133.72 | 2017-04-30 11:25:10 |
| DANA HART             |           133.71 | 2017-04-30 11:25:10 |
| JENNIE TERRY          |           133.71 | 2017-04-30 11:25:10 |
| ROSA REYNOLDS         |           133.70 | 2017-04-30 11:25:10 |
| BESSIE MORRISON       |           132.72 | 2017-04-30 11:25:10 |
| STEVEN CURLEY         |           132.71 | 2017-04-30 11:25:10 |
| JORDAN ARCHULETA      |           132.70 | 2017-04-30 11:25:10 |
| RONALD WEINER         |           132.70 | 2017-04-30 11:25:10 |
| TRACY COLE            |           132.70 | 2017-04-30 11:25:10 |
| COURTNEY DAY          |           132.68 | 2017-04-30 11:25:10 |
| KAREN JACKSON         |           131.73 | 2017-04-30 11:25:10 |
| JAMES GANNON          |           131.70 | 2017-04-30 11:25:10 |
| GEORGE LINTON         |           131.67 | 2017-04-30 11:25:10 |
| KATHRYN COLEMAN       |           130.74 | 2017-04-30 11:25:10 |
| EDUARDO HIATT         |           130.73 | 2017-04-30 11:25:10 |
| JOYCE EDWARDS         |           130.72 | 2017-04-30 11:25:10 |
| MICHELE GRANT         |           130.70 | 2017-04-30 11:25:10 |
| DEBBIE REYES          |           130.68 | 2017-04-30 11:25:10 |
| HAROLD MARTINO        |           130.68 | 2017-04-30 11:25:10 |
| GILBERT SLEDGE        |           129.72 | 2017-04-30 11:25:10 |
| TRACY HERRMANN        |           129.72 | 2017-04-30 11:25:10 |
| CASSANDRA WALTERS     |           129.70 | 2017-04-30 11:25:10 |
| KATHY JAMES           |           129.70 | 2017-04-30 11:25:10 |
| RAMONA HALE           |           129.70 | 2017-04-30 11:25:10 |
| SALVADOR TEEL         |           129.70 | 2017-04-30 11:25:10 |
| VIOLA HANSON          |           129.68 | 2017-04-30 11:25:10 |
| VIRGINIA GREEN        |           129.68 | 2017-04-30 11:25:10 |
| JUSTIN NGO            |           129.64 | 2017-04-30 11:25:10 |
| EDDIE TOMLIN          |           128.73 | 2017-04-30 11:25:10 |
| PATRICIA JOHNSON      |           128.73 | 2017-04-30 11:25:10 |
| JASON MORRISSEY       |           128.72 | 2017-04-30 11:25:10 |
| TERESA ROGERS         |           128.71 | 2017-04-30 11:25:10 |
| MONICA HICKS          |           128.70 | 2017-04-30 11:25:10 |
| JIM REA               |           128.67 | 2017-04-30 11:25:10 |
| SHERRI RHODES         |           128.67 | 2017-04-30 11:25:10 |
| MILTON HOWLAND        |           127.75 | 2017-04-30 11:25:10 |
| JANET PHILLIPS        |           127.73 | 2017-04-30 11:25:10 |
| AMY LOPEZ             |           127.71 | 2017-04-30 11:25:10 |
| MICHAEL SILVERMAN     |           127.71 | 2017-04-30 11:25:10 |
| TERRY CARLSON         |           127.71 | 2017-04-30 11:25:10 |
| WALTER PERRYMAN       |           127.70 | 2017-04-30 11:25:10 |
| FRANK WAGGONER        |           127.68 | 2017-04-30 11:25:10 |
| MARJORIE TUCKER       |           127.68 | 2017-04-30 11:25:10 |
| JOANNE ROBERTSON      |           127.66 | 2017-04-30 11:25:10 |
| MARTHA GONZALEZ       |           127.66 | 2017-04-30 11:25:10 |
| BRADLEY MOTLEY        |           126.73 | 2017-04-30 11:25:10 |
| TERRI VASQUEZ         |           126.73 | 2017-04-30 11:25:10 |
| ANDRE RAPP            |           126.72 | 2017-04-30 11:25:10 |
| SONIA GREGORY         |           126.72 | 2017-04-30 11:25:10 |
| ISAAC OGLESBY         |           126.71 | 2017-04-30 11:25:10 |
| JAIME NETTLES         |           126.71 | 2017-04-30 11:25:10 |
| FLORENCE WOODS        |           126.70 | 2017-04-30 11:25:10 |
| SHIRLEY ALLEN         |           126.69 | 2017-04-30 11:25:10 |
| THELMA MURRAY         |           126.68 | 2017-04-30 11:25:10 |
| VERONICA STONE        |           126.68 | 2017-04-30 11:25:10 |
| RUTH MARTINEZ         |           125.76 | 2017-04-30 11:25:10 |
| ALAN KAHN             |           124.74 | 2017-04-30 11:25:10 |
| RICK MATTOX           |           124.73 | 2017-04-30 11:25:10 |
| BRYAN HARDISON        |           124.72 | 2017-04-30 11:25:10 |
| CRAIG MORRELL         |           124.70 | 2017-04-30 11:25:10 |
| JOY GEORGE            |           124.67 | 2017-04-30 11:25:10 |
| CARRIE PORTER         |           124.66 | 2017-04-30 11:25:10 |
| LYNN PAYNE            |           123.72 | 2017-04-30 11:25:10 |
| NINA SOTO             |           123.71 | 2017-04-30 11:25:10 |
| MARC OUTLAW           |           123.70 | 2017-04-30 11:25:10 |
| MELISSA KING          |           123.66 | 2017-04-30 11:25:10 |
| BEN EASTER            |           122.74 | 2017-04-30 11:25:10 |
| ERIC ROBERT           |           122.73 | 2017-04-30 11:25:10 |
| BRANDY GRAVES         |           122.72 | 2017-04-30 11:25:10 |
| CATHY SPENCER         |           122.71 | 2017-04-30 11:25:10 |
| HILDA HOPKINS         |           122.71 | 2017-04-30 11:25:10 |
| CHRISTY VARGAS        |           122.69 | 2017-04-30 11:25:10 |
| NATHAN RUNYON         |           122.68 | 2017-04-30 11:25:10 |
| HEIDI LARSON          |           122.66 | 2017-04-30 11:25:10 |
| JOHNNIE CHISHOLM      |           121.76 | 2017-04-30 11:25:10 |
| VALERIE BLACK         |           121.74 | 2017-04-30 11:25:10 |
| GERALD FULTZ          |           121.70 | 2017-04-30 11:25:10 |
| JEFFERY PINSON        |           121.69 | 2017-04-30 11:25:10 |
| PHILIP CAUSEY         |           121.69 | 2017-04-30 11:25:10 |
| PAUL TROUT            |           120.77 | 2017-04-30 11:25:10 |
| ALFRED CASILLAS       |           120.74 | 2017-04-30 11:25:10 |
| ARLENE HARVEY         |           120.74 | 2017-04-30 11:25:10 |
| CHARLIE BESS          |           120.74 | 2017-04-30 11:25:10 |
| DAWN SULLIVAN         |           120.74 | 2017-04-30 11:25:10 |
| BYRON BOX             |           120.71 | 2017-04-30 11:25:10 |
| SANDRA MARTIN         |           120.71 | 2017-04-30 11:25:10 |
| VICKIE BREWER         |           120.69 | 2017-04-30 11:25:10 |
+-----------------------+------------------+---------------------+
205 rows in set (0.00 sec)

### 6.6.2 総合問題2

以下のデータベースを使って 後の問に答えてください。

https://sites.google.com/a/dlpage.phi-integration.com/pentaho/mondrian/mysql-foodmart-database/foodmart_mysql.tar.gz?attredirects=0

解説はこちら

https://github.com/julianhyde/foodmart-data-hsqldb

http://www.fromdual.ch/foodmart-old

(1) 1998年1月の従業員の給料ランキングを10位まで表示してください。

(2) sales_fact_1998テーブルの中で、同じ人が同じ時間に買っている商品の2つの組み合わせの中で、購買回数が多い2つの商品はどれとどれでしょうか。TOP5を抽出して、商品名(product_name)でそれぞれ答えてください。なお、商品はproduct_idベースでカウントして、同じ人とはcustomer_idが同じことを意味し、同じ時間とはtime_idが同じことを意味します。なお、これをバスケット分析（同時併売）といい、期間併売で計算することもあります。

・準備

In [22]:
drop database if exists foodmart;

drop database if exists foodmart;

Query OK, 0 rows affected (0.00 sec)

In [23]:
create database foodmart;

create database foodmart;

Query OK, 1 row affected (0.00 sec)

上記のようにデータベースを用意したあとは、以下を実行。

-------------------
mkdir foodmart  
cd foodmart  
wget http://pentaho.dlpage.phi-integration.com/mondrian/mysql-foodmart-database/foodmart_mysql.tar.gz  
tar zxf  foodmart_mysql.tar.gz  
mysql -h"db1" -P"3306" -u root -p"ilect" foodmart < foodmart_mysql.sql  

-------------------

In [1]:
use foodmart;

use foodmart;

Database changed

In [2]:
show tables;

show tables;
+-------------------------------+
| Tables_in_foodmart            |
+-------------------------------+
| account                       |
| agg_c_10_sales_fact_1997      |
| agg_c_14_sales_fact_1997      |
| agg_c_special_sales_fact_1997 |
| agg_g_ms_pcat_sales_fact_1997 |
| agg_l_03_sales_fact_1997      |
| agg_l_04_sales_fact_1997      |
| agg_l_05_sales_fact_1997      |
| agg_lc_06_sales_fact_1997     |
| agg_lc_100_sales_fact_1997    |
| agg_ll_01_sales_fact_1997     |
| agg_pl_01_sales_fact_1997     |
| category                      |
| currency                      |
| customer                      |
| days                          |
| department                    |
| employee                      |
| employee_closure              |
| expense_fact                  |
| inventory_fact_1997           |
| inventory_fact_1998           |
| position                      |
| product                       |
| product_class                 |
| promotion                     |
| region                        |
| reserve_employee              |
| salary                        |
| sales_fact_1997               |
| sales_fact_1998               |
| sales_fact_dec_1998           |
| store                         |
| store_ragged                  |
| time_by_day                   |
| warehouse                     |
| warehouse_class               |
+-------------------------------+
37 rows in set (0.00 sec)

解答　(1)

In [3]:
/*解答(1)*/
select
	main.employee_id,
	main.salary,
	(
		select count(b.pay_date)
		from foodmart.salary b
		where main.salary < b.salary_paid and DATE_FORMAT(b.pay_date,'%Y%m') = '199801'
	) + 1 as rank
from
(
select
	a.employee_id,
	sum(a.salary_paid) salary
from foodmart.salary a
where DATE_FORMAT(a.pay_date,'%Y%m') = '199801'
group by a.employee_id
order by 2 desc
) main
order by main.salary desc
limit 10;

/*解答(1)*/ select main.employee_id, main.salary, ( select count(b.pay_date) from foodmart.salary b where main.salary < b.salary_paid and DATE_FORMAT(b.pay_date,'%Y%m') = '199801' ) + 1 as rank from ( select a.employee_id, sum(a.salary_paid) salary from foodmart.salary a where DATE_FORMAT(a.pay_date,'%Y%m') = '199801' group by a.employee_id order by 2 desc ) main order by main.salary desc limit 10;
+-------------+----------+------+
| employee_id | salary   | rank |
+-------------+----------+------+
|          14 | 154.5455 |    1 |
|          16 | 154.5455 |    1 |
|           9 | 154.5455 |    1 |
|          13 | 136.3636 |    4 |
|          11 | 136.3636 |    4 |
|         748 | 118.1818 |    6 |
|         946 | 118.1818 |    6 |
|        1066 | 118.1818 |    6 |
|         821 | 118.1818 |    6 |
|         885 | 118.1818 |    6 |
+-------------+----------+------+
10 rows in set (0.19 sec)

解答　(2)

In [4]:
/*解答(2)*/
select d.product_name as prod_name_1,e.product_name  as prod_name_2,c.cnt
from (select a.product_id as prod_1,b.product_id as prod_2,count(*) as cnt
from sales_fact_1998 a,sales_fact_1998 b 
where a.product_id > b.product_id and a.time_id=b.time_id and a.customer_id=b.customer_id 
group by 1,2 order by 3 desc limit 5) c 
left outer join product d on c.prod_1 = d.product_id 
left outer join product e on c.prod_2 = e.product_id ;

/*解答(2)*/ select d.product_name as prod_name_1,e.product_name  as prod_name_2,c.cnt from (select a.product_id as prod_1,b.product_id as prod_2,count(*) as cnt from sales_fact_1998 a,sales_fact_1998 b where a.product_id > b.product_id and a.time_id=b.time_id and a.customer_id=b.customer_id group by 1,2 order by 3 desc limit 5) c left outer join product d on c.prod_1 = d.product_id left outer join product e on c.prod_2 = e.product_id ;
+---------------------------------+----------------------------+-----+
| prod_name_1                     | prod_name_2                | cnt |
+---------------------------------+----------------------------+-----+
| Big Time Apple Cinnamon Waffles | Carlson Low Fat Sour Cream |  12 |
| Plato Strawberry Jelly          | Tell Tale New Potatos      |  11 |
| Great Wheat Bread               | Best Choice Salsa Dip      |  11 |
| Big Time Frozen Chicken Breast  | Better Fancy Canned Clams  |  10 |
| Tell Tale Tomatos               | Denny 60 Watt Lightbulb    |  10 |
+---------------------------------+----------------------------+-----+
5 rows in set (8.68 sec)